lryain/ArduinoBoard_Manager/duinopeak-avr-1.1.0/boards.txt
# Duinopeak Boneduino Board Configuration
#
# For more information see:
# - https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# - https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

##############################################################
# Duinopeak Boneduino 32u4 Configuration
boneduino32u4.name=Duinopeak Boneduino 32u4
boneduino32u4.bootloader.low_fuses=0xff
boneduino32u4.bootloader.high_fuses=0xd8
boneduino32u4.bootloader.extended_fuses=0xcb
boneduino32u4.bootloader.file=caterina/Caterina-Boneduino32u4.hex
boneduino32u4.bootloader.unlock_bits=0x3F
boneduino32u4.bootloader.lock_bits=0x2F
boneduino32u4.bootloader.tool=arduino:avrdude
boneduino32u4.build.mcu=atmega32u4
boneduino32u4.build.f_cpu=8000000L
boneduino32u4.build.vid=0x239C
boneduino32u4.build.pid=0x800C
boneduino32u4.build.core=arduino:arduino
boneduino32u4.build.variant=boneduino32u4
boneduino32u4.build.board=AVR_BONEDUINO32U4
boneduino32u4.build.usb_product="Boneduino 32u4"
boneduino32u4.build.usb_manufacturer="Duinopeak"
boneduino32u4.build.extra_flags={build.usb_flags}
boneduino32u4.upload.protocol=avr109
boneduino32u4.upload.maximum_size=28672
boneduino32u4.upload.speed=57600
boneduino32u4.upload.disable_flushing=true
boneduino32u4.upload.use_1200bps_touch=true
boneduino32u4.upload.wait_for_upload_port=true
boneduino32u4.upload.tool=arduino:avrdude
boneduino32u4.vid.0=0x236C
boneduino32u4.pid.0=0x600C

##############################################################
# Duinopeak Boneduino 328P Configuration
boneduino328p.name=Duinopeak Boneduino 328P
boneduino328p.upload.tool=arduino:avrdude
boneduino328p.upload.protocol=arduino
boneduino328p.upload.maximum_size=32256
boneduino328p.upload.maximum_data_size=2048
boneduino328p.upload.speed=57600
boneduino328p.bootloader.tool=arduino:avrdude
boneduino328p.bootloader.low_fuses=0xFF
boneduino328p.bootloader.high_fuses=0xDE
boneduino328p.bootloader.extended_fuses=0x05
boneduino328p.bootloader.unlock_bits=0x3F
boneduino328p.bootloader.lock_bits=0x0F
boneduino328p.bootloader.file=optiboot/optiboot_atmega328.hex
boneduino328p.build.mcu=atmega328p
boneduino328p.build.f_cpu=8000000L
boneduino328p.build.core=arduino:arduino
boneduino328p.build.variant=arduino:standard
boneduino328p.build.board=AVR_BONEDUINO328P

##############################################################
touchtouch.name=TouchTouch
touchtouch.vid.0=0x2A66
touchtouch.pid.0=0x0066
touchtouch.vid.1=0x2A66
touchtouch.pid.1=0x8006
touchtouch.upload.tool=arduino:avrdude
touchtouch.upload.protocol=avr109
touchtouch.upload.maximum_size=28672
touchtouch.upload.maximum_data_size=2560
touchtouch.upload.speed=57600
touchtouch.upload.disable_flushing=true
touchtouch.upload.use_1200bps_touch=true
touchtouch.upload.wait_for_upload_port=true

touchtouch.bootloader.tool=arduino:avrdude
touchtouch.bootloader.low_fuses=0xff
touchtouch.bootloader.high_fuses=0xd8
touchtouch.bootloader.extended_fuses=0xcb
touchtouch.bootloader.file=caterina/Caterina.hex
touchtouch.bootloader.unlock_bits=0x3F
touchtouch.bootloader.lock_bits=0x2F

touchtouch.build.mcu=atmega32u4
touchtouch.build.f_cpu=16000000L
touchtouch.build.vid=0x2A6E
touchtouch.build.pid=0x8003
touchtouch.build.usb_product="TouchTouch"
touchtouch.build.usb_manufacturer="Duinopeak"
touchtouch.build.board=AVR_TOUCHTOUCH
touchtouch.build.core=arduino:arduino
touchtouch.build.variant=arduino:leonardo
touchtouch.build.extra_flags={build.usb_flags}

touchtouch.variant=arduino:standard

##############################################################

touchtouchmidi.name=TouchTouch(USB MIDI, iPad compatible)
touchtouchmidi.vid.0=0x2A66
touchtouchmidi.pid.0=0x0066
touchtouchmidi.vid.1=0x2A66
touchtouchmidi.pid.1=0x8006
touchtouchmidi.upload.tool=arduino:avrdude
touchtouchmidi.upload.protocol=avr109
touchtouchmidi.upload.maximum_size=28672
touchtouchmidi.upload.maximum_data_size=2560
touchtouchmidi.upload.speed=57600
touchtouchmidi.upload.disable_flushing=true
touchtouchmidi.upload.use_1200bps_touch=true
touchtouchmidi.upload.wait_for_upload_port=true

touchtouchmidi.bootloader.tool=arduino:avrdude
touchtouchmidi.bootloader.low_fuses=0xff
touchtouchmidi.bootloader.high_fuses=0xd8
touchtouchmidi.bootloader.extended_fuses=0xcb
touchtouchmidi.bootloader.file=caterina/Caterina.hex
touchtouchmidi.bootloader.unlock_bits=0x3F
touchtouchmidi.bootloader.lock_bits=0x2F

touchtouchmidi.build.mcu=atmega32u4
touchtouchmidi.build.f_cpu=16000000L
touchtouchmidi.build.vid=0x2A6E
touchtouchmidi.build.pid=0x8003
touchtouchmidi.build.usb_product="TouchTouch"
touchtouchmidi.build.usb_manufacturer="Duinopeak"
touchtouchmidi.build.board=AVR_TOUCHTOUCH
touchtouchmidi.build.core=arcore
touchtouchmidi.build.variant=arduino:leonardo
touchtouchmidi.build.extra_flags=-DUSB_VID={build.vid} -DUSB_PID={build.pid} -DIPAD_COMPAT

touchtouchmidi.variant=arduino:standard
